# ======================================================
# Input Function in Python
# آموزش کامل تابع input()
# ======================================================


# ======================================================
# 1. ساده‌ترین استفاده از input
# ======================================================

name = input("Enter your name: ")

print(name)
print()


# ======================================================
# 2. ذخیره در متغیر
# ======================================================

city = input("Enter your city: ")

print(city)
print()


# ======================================================
# 3. دریافت چند ورودی
# ======================================================

first_name = input("First Name: ")
last_name = input("Last Name: ")

print(first_name)
print(last_name)
print()


# ======================================================
# 4. ترکیب با print
# ======================================================

name = input("What is your name? ")

print("Hello", name)
print()


# ======================================================
# 5. استفاده از f-string
# ======================================================

country = input("Country: ")

print(f"You live in {country}.")
print()


# ======================================================
# 6. بررسی نوع داده
# ======================================================

age = input("Age: ")

print(age)
print(type(age))
print()


# ======================================================
# 7. مثال از مشکل String بودن
# ======================================================

number = input("Enter a number: ")

print(number + number)

# اگر کاربر 10 وارد کند
# خروجی:
# 1010

print()


# ======================================================
# 8. تبدیل به عدد (پیش‌نمایش Casting)
# ======================================================

number = int(input("Enter another number: "))

print(number + number)

print()


# ======================================================
# 9. دریافت اطلاعات مختلف
# ======================================================

name = input("Name: ")
age = input("Age: ")
city = input("City: ")

print("Name :", name)
print("Age  :", age)
print("City :", city)

print()


# ======================================================
# 10. نمونه واقعی
# ======================================================

product = input("Product Name: ")
price = input("Product Price: ")

print(f"Product: {product}")
print(f"Price: {price}")

print()


# ======================================================
# پایان مبحث Input
# ======================================================